<!doctype html>



  


<html class="theme-next muse use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  
    
      
    

    
  

  

  
    
      
    

    
  

  
    
      
    

    
  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Monda:300,300italic,400,400italic,700,700italic|Roboto Slab:300,300italic,400,400italic,700,700italic|Monda:300,300italic,400,400italic,700,700italic|true:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="&amp;#x62C9;&amp;#x65AF;&amp;#x79D1;&amp;#x6280;&amp;#x7684;&amp;#x5FEB;&amp;#x4E50;&amp;#x6492;&amp;#x5F00;&amp;#x4E86;&amp;#x70B9;&amp;#x6765;&amp;#x770B;&amp;#x62C9;&amp;#x65AF;&amp;#x79D1;&amp;#x6280;&amp;#x7684;&amp;#x5FEB;&amp;#x4E50;&amp;#x6492;&amp;#x5F00;&amp;#x4E86;&amp;#x70B9;&amp;#x6765;">
<meta property="og:type" content="article">
<meta property="og:title" content="iOS-如何给一个控件添加点击区域">
<meta property="og:url" content="http://blog.funnnyboy.com/2016/12/27/iOS-如何给一个控件添加点击区域/index.html">
<meta property="og:site_name" content="funnnyboy的技术博客">
<meta property="og:description" content="&amp;#x62C9;&amp;#x65AF;&amp;#x79D1;&amp;#x6280;&amp;#x7684;&amp;#x5FEB;&amp;#x4E50;&amp;#x6492;&amp;#x5F00;&amp;#x4E86;&amp;#x70B9;&amp;#x6765;&amp;#x770B;&amp;#x62C9;&amp;#x65AF;&amp;#x79D1;&amp;#x6280;&amp;#x7684;&amp;#x5FEB;&amp;#x4E50;&amp;#x6492;&amp;#x5F00;&amp;#x4E86;&amp;#x70B9;&amp;#x6765;">
<meta property="og:updated_time" content="2016-12-28T12:47:01.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="iOS-如何给一个控件添加点击区域">
<meta name="twitter:description" content="&amp;#x62C9;&amp;#x65AF;&amp;#x79D1;&amp;#x6280;&amp;#x7684;&amp;#x5FEB;&amp;#x4E50;&amp;#x6492;&amp;#x5F00;&amp;#x4E86;&amp;#x70B9;&amp;#x6765;&amp;#x770B;&amp;#x62C9;&amp;#x65AF;&amp;#x79D1;&amp;#x6280;&amp;#x7684;&amp;#x5FEB;&amp;#x4E50;&amp;#x6492;&amp;#x5F00;&amp;#x4E86;&amp;#x70B9;&amp;#x6765;">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Muse',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '6298547677017671000',
      author: '作者'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>







  <title> iOS-如何给一个控件添加点击区域 | funnnyboy的技术博客 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">funnnyboy的技术博客</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
    
      <p class="site-subtitle">一个阳光积极的少年</p>
    
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://blog.funnnyboy.com/2016/12/27/iOS-如何给一个控件添加点击区域/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="funnnyboy">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/touxiang.jpg">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="funnnyboy的技术博客">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="funnnyboy的技术博客" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                iOS-如何给一个控件添加点击区域
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-12-27T22:42:37+08:00">
                2016-12-27
              </time>
            

            

            
          </span>

          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <span class="post-meta-item-icon">
                  <i class="fa fa-comment-o"></i>
                </span>
                <a href="/2016/12/27/iOS-如何给一个控件添加点击区域/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/12/27/iOS-如何给一个控件添加点击区域/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          
             <span id="/2016/12/27/iOS-如何给一个控件添加点击区域/" class="leancloud_visitors" data-flag-title="iOS-如何给一个控件添加点击区域">
               <span class="post-meta-divider">|</span>
               <span class="post-meta-item-icon">
                 <i class="fa fa-eye"></i>
               </span>
               
                 <span class="post-meta-item-text">阅读次数 </span>
               
                 <span class="leancloud-visitors-count"></span>
             </span>
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br><a id="more"></a><br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;<br>&#x62C9;&#x65AF;&#x79D1;&#x6280;&#x7684;&#x5FEB;&#x4E50;&#x6492;&#x5F00;&#x4E86;&#x70B9;&#x6765;&#x770B;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/12/27/网络抓包工具Charles/" rel="prev" title="网络抓包工具Charles">
                网络抓包工具Charles <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          

  <p>热评文章</p>
  <div class="ds-top-threads" data-range="weekly" data-num-items="4"></div>


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/12/27/iOS-如何给一个控件添加点击区域/"
           data-title="iOS-如何给一个控件添加点击区域" data-url="http://blog.funnnyboy.com/2016/12/27/iOS-如何给一个控件添加点击区域/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel sidebar-panel-active">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/touxiang.jpg"
               alt="funnnyboy" />
          <p class="site-author-name" itemprop="name">funnnyboy</p>
          <p class="site-description motion-element" itemprop="description">Everything is going on, but do not give up trying</p>
        </div>
        <nav class="site-state motion-element">
        
          
            <div class="site-state-item site-state-posts">
              <a href="/archives">
                <span class="site-state-item-count">2</span>
                <span class="site-state-item-name">日志</span>
              </a>
            </div>
          

          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

        


      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">funnnyboy的技术博客</span>
</div>



        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"funnnyboy"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  










  
  

  

  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("LJr39Ezpgu5uDlxYWTxnYEvR-gzGzoHsz", "iS54PHefd96tPJLicdOxBxrc");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
          for(var i = 0; i < entries.length; i++) {
            var url = entries[i];
            var element = document.getElementById(url);
            var countSpan = $(element).find(COUNT_CONTAINER_REF);
            if( countSpan.text() == '') {
              countSpan.text(0);
            }
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            /* Set ACL */
            var acl = new AV.ACL();
            acl.setPublicReadAccess(true);
            acl.setPublicWriteAccess(true);
            newcounter.setACL(acl);
            /* End Set ACL */
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>



  

  


</body>
</html>
